# RebarShapeConstraintSegmentLength Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarShapeConstraintSegmentLength Class
Members See Also
---
A constraint that controls the length of a segment.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public class RebarShapeConstraintSegmentLength : RebarShapeConstraint
```

Visual Basic
---
```text
Public Class RebarShapeConstraintSegmentLength _
	Inherits RebarShapeConstraint
```

Visual C++
---
```text
public ref class RebarShapeConstraintSegmentLength : public RebarShapeConstraint
```

# Remarks
The constraint has two references, indexed by 0 and 1, that do not have to correspond to the start and end of the segment.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Structure..::..RebarShapeConstraint Autodesk.Revit.DB.Structure..::..RebarShapeConstraintSegmentLength
# See Also
RebarShapeConstraintSegmentLength Members
Autodesk.Revit.DB.Structure Namespace